/* Завдання: Написати програму яка буде перевіряти чи рік народження
              користувача був високосним
            </p>
            <p>
              Наприклад: 2000, 2004, 2016 - <strong>високосні</strong> 1998,
              2002, 1900 2100 - <strong> не високосні</strong>*/

let year = prompt("Укажите год рождения");
if (
  ((year % 4 === 0 && year % 100 !== 0) || year % 400 === 0) &&
  year !== null &&
  year.length
) {
  alert("Высокосный год!");
} else if (Number(year) + 1 && year !== null && year != "") {
  alert("Не высокосный год");
} else {
  alert("Указанное значение не является годом");
}
