/* Написати програму де компютер загадає число від 1 до 10 і
              запропонує користувачу вгадати його Користувач вводить свій
              варіант і отримує результат (Виграв чи ні) Вивести результат в
              форматі "Вітаю ви вгадали число (тут варіант компютера)" або "Ви
              програли, компютер загадав (тут варіант компютера)" */

let ranValue = Math.ceil(Math.random() * 10);

let userGuess = prompt("Угадайте число от 1 до 10");

userGuess === ranValue
  ? alert(`Вітаю ви вгадали число ${ranValue}`)
  : alert(`Ви програли, компютер загадав ${ranValue}`);
